app/Controllers/LoginController.php

                return redirect()->to(site_url('login'))->with('error', 'Veuillez saisir votre numéro de téléphone.');
            }

            $client = $this->clientModel->where('telephone', $numero)->first();
---
SELECT *
FROM `client`
WHERE `telephone` = '0321234567'
 LIMIT 1