app/Controllers/TransactionController.php

SELECT *
FROM `operation`
---
    public function index()
    {
        $operationModel = new \App\Models\OperationModel();

        $data['operations'] = $operationModel->findAll();